#include <iostream>
#include "newton_method.h"

using namespace std;

int main() {
    setlocale(LC_ALL, "Russian");
    double x1 = 1, x2 = 1,M1=0.01, M2 = 0.05, M3 = 0.1; // Начальное приближение
    double epsilon1 = 1e-9, epsilon2 = 1e-9; // Точность
    int NIT = 15; // Предельное число итераций
    newtonMethod(x1, x2, epsilon1, epsilon2, NIT);
    cout << "------------------------------------------------------------------" << endl;
    cout << "----------------------Решение 2 способом--------------------------" << endl;
    cout << "------------------------------------------------------------------" << endl;
    solutionM(x1, x2, M1, epsilon1, epsilon2, NIT);
    cout << "------------------------------------------------------------------" << endl;
    cout << "-----------------------------M=0.05-------------------------------" << endl;
    cout << "------------------------------------------------------------------" << endl;
    solutionM(x1, x2, M2, epsilon1, epsilon2, NIT);

    cout << "------------------------------------------------------------------" << endl;
    cout << "------------------------------M=0.5-------------------------------" << endl;
    cout << "------------------------------------------------------------------" << endl;
    solutionM(x1, x2, M3, epsilon1, epsilon2, NIT);

    

    return 0;
}